Tests/Functional/Fixtures/TestServicePingRequest.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:test="http://tempuri.org/service/soap/typo3.soap/tests/functional/fixtures/test">
   <soapenv:Header/>
   <soapenv:Body>
      <test:ping>
         <value>Hello, echo!</value>
      </test:ping>
   </soapenv:Body>
</soapenv:Envelope>
